package utils

var chars = map[string]string{
	"a": "AaÁáÀàÂâǍǎĂăÃãẢảȦȧẠạÄäÅåḀḁĀāĄąᶏȺⱥȀȁẤấẦầẪẫẨẩẬậẮắẰằẴẵẲẳẶặǺǻǠǡǞǟȀȁȂȃⱭɑᴀⱯɐɒＡａÆæᴁᴭᵆǼǽǢǣᴂ",
	"b": "BbḂḃḄḅḆḇƁƀƃɃƂƁℬᴃＢｂḀḁḂḃḄḅḆḇƁƀƃɃƂƁℬᴃ",
	"c": "CcĆćĈĉĊċČčƇƈȻȼᴄＣｃÇçḈḉĆćĈĉĊċČčƇƈȻȼᴄ",
	"d": "DdḊḋḌḍḎḏḐḑḒḓƉƊɗƋƌᵯᴅＤｄḊḋḌḍḎḏḐḑḒḓƉƊɗƋƌᵯᴅ",
	"e": "EeÉéÈèÊêḔḕḖḗḚḛḜḝḞḟẸẹẺẻẼẽẾếỀềỄễỆệƎƏƐɘᴇＥｅḔḕḖḗḚḛḜḝḞḟẸẹẺẻẼẽẾếỀềỄễỆệƎƏƐɘᴇ",
	"f": "FfƑƒᵱᴆＦｆ",
	"g": "GgĜĝĞğĠġĢģǴǵƓɠᴈＧｇĜĝĞğĠġĢģǴǵƓɠᴈ",
	"h": "HhĤĥĦħḤḥḦḧḨḩḪḫẖẖĦħḤḥḦḧḨḩḪḫẖẖⱧⱨȞȟᴉＨｈĤĥĦħḤḥḦḧḨḩḪḫẖẖĦħḤḥḦḧḨḩḪḫẖẖⱧⱨȞȟᴉ",
	"i": "IiÍíÌìĨĩĪīĬĭǏǐȈȉȊȋỈỉỊịḬḭḮḯƗɨᵻᴊＩｉĪīĬĭǏǐȈȉȊȋỈỉỊịḬḭḮḯƗɨᵻᴊ",
	"j": "JjĴĵǰȷʝɉʟᴋＪｊĴĵǰȷʝɉʟᴋ",
	"k": "KkḰḱḲḳḴḵƘƙⱩⱪᴋＫｋḰḱḲḳḴḵƘƙⱩⱪᴋ",
	"l": "LlĿŀĿŁłĽľĻļḶḷḸḹḼḽḺḻĿŀŁłĽľĻļḶḷḸḹḼḽḺḻⱠⱡⱢɫɬᶅɭȴⱡⱢɫɬᶅɭȴ",
	"m": "MmḾḿṀṁṂṃƜƝⱮᴌＭｍḾḿṀṁṂṃƜƝⱮᴌ",
	"n": "NnÑñŃńŅņŇňǸǹƝɲȠƞᵰᴍＮｎŃńŅņŇňǸǹƝɲȠƞᵰᴍ",
	"o": "OoÓóÒòÔôÕõǑǒŌōŎŏȮȯȰȱÖöØøǾǿǪǫǬǭŐőÕõǑǒŌōŎŏȮȯȰȱÖöØøǾǿǪǫǬǭŐőⱺƆɵᴏＯｏÓóÒòÔôÕõǑǒŌōŎŏȮȯȰȱÖöØøǾǿǪǫǬǭŐőÕõǑǒŌōŎŏȮȯȰȱÖöØøǾǿǪǫǬǭŐőⱺƆɵᴏ",
	"p": "PpṔṕṖṗⱣᵽᴘＰｐṔṕṖṗⱣᵽᴘ",
	"q": "QqɊɋʠᴠＱｑɊɋʠᴠ",
	"r": "RrŔŕŖŗŘřȐȑȒȓṘṙṚṛṜṝṞṟɌɍᴡＲｒŔŕŖŗŘřȐȑȒȓṘṙṚṛṜṝṞṟɌɍᴡ",
	"s": "SsŚśŜŝŞşŠšȘșSsŚśŜŝŞşŠšȘșⱾⱿȘșSsŚśŜŝŞşŠšȘșⱾⱿȘș",
	"t": "TtŢţŤťŦŧƬƭȚțȾⱦᴛＴｔŢţŤťŦŧƬƭȚțȾⱦᴛ",
	"u": "UuÚúÙùÜüŨũŪūŬŭŮůÜüÚúÙùÜüŨũŪūŬŭŮůƯưƱƲƳƴɄʉᴜＵｕÚúÙùÜüŨũŪūŬŭŮůÜüÚúÙùÜüŨũŪūŬŭŮůƯưƱƲƳƴɄʉᴜ",
	"v": "VvṼṽṾṿƲʋᴠＶｖṼṽṾṿƲʋᴠ",
	"w": "WwẀẁẂẃẄẅẆẇẈẉƜⱲⱳᴡＷｗẀẁẂẃẄẅẆẇẈẉƜⱲⱳᴡ",
	"x": "XxẊẋẌẍⱲⱳᴢＸｘẊẋẌẍⱲⱳᴢ",
	"y": "YyÝýÿŶŷŸÿỲỳỴỵỶỷỸỹȲȳɎɏƳʝᴢＹｙÝýÿŶŷŸÿỲỳỴỵỶỷỸỹȲȳɎɏƳʝᴢ",
	"z": "ZzŹźŻżŽžƵƶȤȥʐʑʒᴢＺｚŹźŻżŽžƵƶȤȥʐʑʒᴢ",
}

func ConvertChar(c string) string {
	return chars[c]
}
